/**
 * Created by huangxinping on 2/13/14.
 *
 * 全局数据变量
 *
 */

// 当前关卡
var g_current_level = 1;

// 关卡描述
var g_state_level = [
    1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
//    1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1

];

// 关卡最大值
var g_level_max = 24;

// 关卡问题回答提示
var g_level_answer_tip = true;

// 获取到的得分（通关后会有显示）
var g_current_score = [
    0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
];

// 引导页显示
var g_guide_state = [
    0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
];

// 声音开关
var g_audio_state = true;

// 方向枚举
var DIRECTION_UP = 0;
var DIRECTION_DOWN = 1;
var DIRECTION_LEFT = 2;
var DIRECTION_RIGHT = 3;

// 是否本地服务
var LOCAL_SERVICE = 0;

// 游戏中使用数据
var level_config = [
    { // 关卡1
        torch:[
            [160,768-656+20],
            [167,768-527+20],
            [179,768-384+20],
            [52,768-503+20],
            [140,768-208+20],
            [44,768-51+20],
            [145,768-52+20],
            [417,768-63+20],
            [471,768-467+20],
            [581,768-639+20],
            [670,768-450+20],
            [614,768-294+20],
            [577,768-179+20],
            [748,768-249+20],
            [821,768-302+20],
            [825,768-56+20],
            [820,768-556+20],
            [951,768-202+20],
            [958,768-267+20],
            [983,768-413+20]
        ],
        answer:[ // 问题列表
            {
                title:"《红楼梦》最早的传播者和评点人是谁？",
                keys:["A、高鹗","B、程伟元","C、聊斋","D、脂砚斋"],
                result:4
            },
            {
                title:"下列不属于十二钗正册的人物是：",
                keys:["A、妙玉","B、巧姐","C、薛宝琴","D、史湘云"],
                result:3
            },
            {
                title:"林黛玉的老家在：",
                keys:["A、苏州","B、杭州","C、扬州","D、金陵"],
                result:1
            },
            {
                title:"秦可卿的丧事是由谁主持操办的？",
                keys:["A、尤氏","B、王熙凤","C、贾琏","D、贾政"],
                result:2
            },
            {
                title:"“女人是水做的骨肉”“男人是泥做的骨肉”是谁说的？",
                keys:["A、柳湘莲","B、贾宝玉","C、林黛玉","D、史湘云"],
                result:2
            }
        ],
        roleDirection:3, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
        ],
        skeleton:[ // 骷髅
        ],
        fence: { // 栅栏
            default: [
            ],
            change:[
            ]
        },
        transport:[ // 传送门
        ],
        fixed: [ // 固定物
            {
                type:2,
                position:[710,768-661]
            },
            {
                type:1,
                position:[88,768-646]
            }
        ],
        doorOffset:[18,0], // 门的偏移
        grid:[70,70], // 网格大小
        gridOffset:[20,0], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
            // 5 - 碗)
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6],
            [0,0,2,0,0,0,6,6,6,3,6,1,0,6],
            [6,6,6,6,6,0,6,6,0,0,0,0,0,6],
            [6,6,6,6,6,0,6,0,0,0,6,6,0,6],
            [6,0,0,0,6,0,6,5,6,0,0,6,0,6],
            [6,0,6,0,6,0,6,0,6,0,0,0,0,6],
            [6,0,6,0,6,0,6,0,6,6,6,6,0,6],
            [6,0,6,0,6,0,0,0,6,5,0,6,0,6],
            [6,5,6,0,0,0,0,0,6,0,0,0,0,6],
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6]
        ]
    },
    { // 关卡2
        torch:[
            [184,768-20],
            [440,768-46],
            [173,768-165],
            [441,768-170],
            [598,768-174],
            [727,768-109],
            [887,768-108],
            [980,768-163],
            [754,768-235],
            [986,768-239],
            [218,768-316],
            [505,768-340],
            [819,768-329],
            [985,768-363],
            [59,768-490],
            [261,768-483],
            [463,768-478],
            [632,768-482],
            [798,768-550],
            [156,768-643],
            [580,768-630],
            [946,768-634]
        ],
        answer:[ // 问题列表
            {
                title:"妙玉出家修行的地方是：",
                keys:["A、水月庵","B、馒头庵","C、芦雪庵","D、栊翠庵"],
                result:4
            },
            {
                title:"在大观园里，李纨的住处名叫：",
                keys:["A、稻香村","B、秋爽斋","C、蘅芜苑","D、紫菱洲"],
                result:1
            },
            {
                title:"聪明能干，远嫁他乡的人物是：",
                keys:["A、迎春","B、薛宝琴","C、探春","D、史湘云"],
                result:3
            },
            {
                title:"温顺软弱、逆来顺受、被丈夫虐待致死的人物是：",
                keys:["A、探春","B、香菱","C、迎春","D、秦可卿"],
                result:3
            },
            {
                title:"“机关算尽太聪明，反误了卿卿性命”说的是：",
                keys:["A、王熙凤","B、秦可卿","C、林黛玉","D、贾元春"],
                result:1
            }
        ],
        roleDirection:2, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
        ],
        skeleton:[ // 骷髅
        ],
        fence: { // 栅栏
            default: [
            ],
            change:[
            ]
        },
        transport:[ // 传送门
        ],
        fixed: [ // 固定物
            {
                type:1,
                position:[797,768-119]
            }
        ],
        doorOffset:[4,25], // 门的偏移
        grid:[75,75], // 网格大小
        gridOffset:[-13,36-75], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
            // 5 - 碗)
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6],
            [6,3,0,0,0,5,6,0,0,5,0,0,0,6],
            [6,6,6,6,0,0,6,0,6,6,6,6,0,6],
            [6,0,0,0,0,0,1,0,0,0,6,0,0,6],
            [6,0,6,6,0,6,0,0,0,0,0,0,0,2],
            [6,0,6,0,0,6,6,0,0,0,6,6,0,6],
            [6,0,6,0,0,0,0,0,0,0,0,0,0,6],
            [6,6,6,6,6,0,6,6,6,5,6,6,0,6],
            [6,0,0,0,0,0,0,0,6,0,0,0,0,6],
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6]
        ]
    },
    { // 关卡3
        torch:[
            [198,768-67],
            [431,768-37],
            [728,768-58],
            [30,768-184],
            [137,768-207],
            [504,768-195],
            [972,768-162],
            [325,768-300],
            [690,768-260],
            [950,768-262],
            [710,768-320],
            [172,768-368],
            [574,768-390],
            [40,768-450],
            [421,768-457],
            [814,768-435],
            [263,768-535],
            [710,768-516],
            [30,768-598],
            [932,768-616],
            [580,768-628]
        ],
        answer:[ // 问题列表
            {
                title:"冷香丸”是谁吃的药：",
                keys:["A、薛宝钗","B、林黛玉","C、宝玉","D 、李纨"],
                result:1
            },
            {
                title:"“心较比干多一窍，病如西子胜三分”写的人是：",
                keys:["A、秦可卿","B、贾迎春","C、尤二姐","D 、林黛玉"],
                result:4
            },
            {
                title:"被视为宝钗和黛玉的影子的两个人物分别是谁？",
                keys:["A、宝琴 晴雯","B、袭人 晴雯","C、袭人 香菱","D、宝琴 香菱"],
                result:2
            },
            {
                title:"“枉自温柔和顺，空云似桂如兰。堪羡优伶有福，谁知公子无缘。”说的是：",
                keys:["A、薛宝钗","B、邢岫烟","C、袭人","D、史湘云"],
                result:3
            },
            {
                title:" “品格端方，容貌丰美。行为豁达，随时从分”说的人物是：",
                keys:["A、林黛玉","B、薛宝钗","C、贾探春","D、史湘云"],
                result:2
            }
        ],
        roleDirection:2, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [3,1],
                    [8,1]
                ]
            },
            {
                "direction":0,
                "fat":[
                    [8,5],
                    [12,5]
                ]
            },
            {
                "direction":0,
                "fat":[
                    [1,8],
                    [4,8]
                ]
            }
        ],
        skeleton:[ // 骷髅
        ],
        fence: { // 栅栏
            default: [
            ],
            change:[
            ]
        },
        transport:[ // 传送门
        ],
        fixed: [ // 固定物
        ],
        doorOffset:[12,35], // 门的偏移
        grid:[75,75], // 网格大小
        gridOffset:[-15,-30], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
            // 5 - 碗)
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6],
            [6,3,6,0,0,0,0,0,0,6,1,0,0,6],
            [6,0,0,0,6,0,6,6,6,6,6,0,0,6],
            [6,0,6,0,6,0,5,0,0,6,0,0,6,6],
            [6,0,6,0,6,0,0,0,0,6,0,0,0,2],
            [6,0,6,0,6,6,6,6,0,0,0,0,0,6],
            [6,0,0,0,0,6,0,0,0,6,6,6,0,6],
            [6,0,6,6,0,6,0,6,6,6,0,0,0,6],
            [6,0,0,0,5,6,0,0,0,5,0,0,0,6],
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6]
        ]
    },
    { // 关卡4
        torch:[
            [184,768-50],
            [422,768-54],
            [788,768-46],
            [929,768-48],
            [62,768-88],
            [566,768-116],
            [826,768-142],
            [43,768-190],
            [304,768-216],
            [490,768-214],
            [976,768-264],
            [346,768-316],
            [172,768-346],
            [826,768-360],
            [58,768-504],
            [422,768-470],
            [716,768-483],
            [973,768-495],
            [46,768-607],
            [580,768-642],
            [875,768-643]
        ],
        answer:[ // 问题列表
            {
                title:"心比天高，命比纸薄”的代表人物是：",
                keys:["A、探春","B、晴雯","C、贾元春","D、妙玉"],
                result:2
            },
            {
                title:"下面肖像描写，写的是《红楼梦》那个人物？“彩绣辉煌，恍若神妃仙子”，一双丹凤三角眼，两弯柳叶吊梢眉，身量苗条，体格风骚，粉面含春威不露，丹唇未起笑先闻。",
                keys:["A、秦可卿","B、贾迎春","C、王熙凤","D 、林黛玉"],
                result:3
            },
            {
                title:"判词“可叹停机德，堪怜咏絮才；玉带林中挂，金钗雪里埋”，写的是哪两个人物？",
                keys:["A、探春 迎春","B、宝钗 黛玉","C、元春 黛玉","D、宝钗 惜春"],
                result:2
            },
            {
                title:"诗句：“无故寻愁觅恨，有时似傻如狂。纵然生得好皮囊，腹内原来草莽。潦倒不通世务，愚顽怕读文章。行为偏僻性乖张，那管世人诽谤”描写的是谁？",
                keys:["A、宝玉","B、贾琏","C、贾蓉","D、贾环"],
                result:1
            },
            {
                title:" “品格端方，容貌丰美。行为豁达，随时从分”说的人物是：",
                keys:["A、林黛玉","B、史湘云","C、贾探春","D、薛宝钗"],
                result:4
            }
        ],
        roleDirection:1, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [1,2],
                    [4,2]
                ]
            },
            {
                "direction":0,
                "fat":[
                    [8,4],
                    [10,4]
                ]
            },
            {
                "direction":0,
                "fat":[
                    [2,6],
                    [4,6]
                ]
            }
        ],
        skeleton:[ // 骷髅
        ],
        fence: { // 栅栏
            default: [
            ],
            change:[
            ]
        },
        transport:[ // 传送门
        ],
        fixed: [ // 固定物
            {
                type:1,
                position:[412,768-210]
            }
        ],
        doorOffset:[20,15], // 门的偏移
        grid:[73,73], // 网格大小
        gridOffset:[0,-14], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
            // 5 - 碗)
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6],
            [6,0,6,0,0,0,0,6,1,0,0,0,0,6],
            [6,0,0,0,0,6,0,0,0,5,0,6,0,6],
            [6,6,6,0,6,6,6,0,0,0,0,6,0,6],
            [6,6,6,0,6,0,0,0,0,0,0,0,0,6],
            [0,0,0,2,0,0,0,0,0,6,5,6,0,6],
            [6,6,0,0,0,6,0,0,0,0,0,6,0,6],
            [6,0,0,5,0,6,6,6,0,6,6,6,0,6],
            [6,0,0,6,0,0,0,0,0,6,3,0,0,6],
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6]
        ]
    },
    { // 关卡5
        torch:[
            [51,768-82],
            [219,768-40],
            [421,768-45],
            [803,768-45],
            [824,768-112],
            [64,768-249],
            [571,768-130],
            [286,768-258],
            [498,768-247],
            [666,768-231],
            [963,768-261],
            [163,768-352],
            [46,768-497],
            [242,768-468],
            [466,768-474],
            [755,768-431],
            [974,768-401],
            [155,768-657],
            [372,768-648],
            [580,768-647],
            [737,768-647],
            [949,768-649]
        ],
        answer:[ // 问题列表
            {
                title:"下列语句不是出自《红楼梦》的一句是:",
                keys:["A、字字看来都是血，十年辛苦不寻常。","B、女儿是水做的骨肉，男子是泥做的骨肉。","C、话说天下大势,合久必分,分久必合。","D、世人都晓神仙好,惟有功名忘不了。"],
                result:3
            },
            {
                title:"命途多舛，从小被人拐子拐卖的人物是：",
                keys:["A、鸳鸯","B、晴雯","C、袭人","D、香菱"],
                result:4
            },
            {
                title:"俊眼修眉，顾盼神飞，文采精华，见之忘俗”；“腮凝新荔，鼻腻鹅脂，温柔沉默，观之可亲”分别写的是哪两个人物？",
                keys:["A、探春 迎春","B、探春  薛宝钗"," C、史湘云  迎春","D、史湘云  薛宝钗"],
                result:1
            },
            {
                title:"贾家四姐妹中，性格最孤介冷漠是谁？",
                keys:["A、元春","B、迎春","C、探春","D、惜春"],
                result:4
            },
            {
                title:"王熙凤和王夫人的关系是：",
                keys:["A、姑侄关系","B、婶侄关系","C、姑表关系","D、姨侄关系"],
                result:1
            }
        ],
        roleDirection:1, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [10,8],
                    [12,8]
                ]
            },
            {
                "direction":1,
                "fat":[
                    [5,4],
                    [5,7]
                ]
            }
        ],
        skeleton:[ // 骷髅
        ],
        fence: { // 栅栏
            default: [
            ],
            change:[
            ]
        },
        transport:[ // 传送门
        ],
        fixed: [ // 固定物
        ],
        doorOffset:[20,10], // 门的偏移
        grid:[73,73], // 网格大小
        gridOffset:[0,-14], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
            // 5 - 碗)
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6],
            [6,0,0,0,0,0,0,0,0,0,0,6,6,6],
            [0,2,0,0,0,4,6,6,5,0,0,0,4,6],
            [6,0,6,6,0,0,6,0,0,6,0,0,0,6],
            [6,0,0,0,0,0,0,1,0,0,0,0,0,6],
            [6,0,6,0,0,0,6,0,0,0,0,5,0,6],
            [6,0,6,6,6,0,6,0,0,6,6,6,0,6],
            [6,0,6,0,0,0,0,0,0,6,0,0,0,6],
            [6,0,5,0,0,0,0,4,6,6,0,0,0,6],
            [6,6,6,6,6,6,6,6,6,6,6,6,3,6]
        ]
    },
    { // 关卡6
        torch:[
            [210,768-49],
            [421,768-51],
            [609,768-50],
            [789,768-53],
            [38,768-122],
            [371,768-152],
            [565,768-191],
            [818,768-159],
            [988,768-189],
            [136,768-225],
            [495,768-271],
            [702,768-250],
            [37,768-453],
            [195,768-431],
            [797,768-426],
            [977,768-401],
            [463,768-491],
            [136,768-532],
            [637,768-564],
            [797,768-538],
            [80,768-623],
            [229,768-634],
            [848,768-638]
        ],
        answer:[ // 问题列表
            {
                title:"《红楼梦》中第一次结诗社的地点在：",
                keys:["A、潇湘馆","B、蘅芜苑","C、秋爽斋","D、稻香村"],
                result:3
            },
            {
                title:"贾环和贾兰是宝玉的：",
                keys:["A、侄儿 弟弟","B、弟弟 侄儿","C、侄儿 侄儿","D、弟弟 弟弟"],
                result:2
            },
            {
                title:"迎春的贴身丫鬟是：",
                keys:["A、司棋","B、入画","C、彩云","D、小红"],
                result:1
            },
            {
                title:"尤二姐是以什么方式自尽的？",
                keys:["A、投水","B、服毒","C、上吊","D、吞金"],
                result:4
            },
            {
                title:"“撕扇子作千金一笑”的人物是谁？",
                keys:["A、五儿","B、小红","C、晴雯","D、小燕"],
                result:3
            }
        ],
        roleDirection:1, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [3,1],
                    [5,1]
                ]
            },
            {
                "direction":1,
                "fat":[
                    [3,4],
                    [3,7]
                ]
            },
            {
                "direction":0,
                "fat":[
                    [7,4],
                    [12,4]
                ]
            }
        ],
        skeleton:[ // 骷髅
        ],
        fence: { // 栅栏
            default: [
            ],
            change:[
            ]
        },
        transport:[ // 传送门
        ],
        fixed: [ // 固定物
        ],
        doorOffset:[20,2], // 门的偏移
        grid:[74,74], // 网格大小
        gridOffset:[-20,-28], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
            // 5 - 碗)
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6],
            [6,4,6,0,0,0,6,4,1,0,0,6,6,6],
            [6,0,0,0,0,6,6,6,0,0,0,6,4,6],
            [6,0,6,6,5,0,6,0,0,6,0,6,2,0],
            [6,0,6,0,0,0,6,0,0,0,0,0,0,6],
            [6,0,0,0,0,0,0,0,0,0,0,6,0,6],
            [6,0,6,0,0,0,0,0,0,0,6,6,0,6],
            [6,0,6,0,6,6,6,6,6,0,6,0,0,6],
            [3,5,0,5,0,0,4,6,6,0,0,0,0,6],
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6]
        ]
    },
    { // 关卡7
        torch:[
            [95,768-177],
            [228,768-102],
            [585,768-36],
            [779,768-32],
            [970,768-133],
            [782,768-231],
            [532,768-289],
            [195,768-396],
            [640,768-392],
            [973,768-360],
            [113,768-504],
            [349,768-541],
            [502,768-519],
            [820,768-503],
            [236,768-655],
            [954,768-635]
        ],
        answer:[ // 问题列表
            {
                title:"袭人姓什么？",
                keys:["A、金","B、李","C、刘","D、花"],
                result:4
            },
            {
                title:"说话咬舌头，把“二哥哥”说成“爱哥哥”的人是谁？",
                keys:["A、薛宝琴","B、史湘云","C、邢岫烟","D、探春"],
                result:2
            },
            {
                title:"大观园里曾两次结诗社，第二次结的叫什么社？谁是社主？",
                keys:["A、菊花社  林黛玉","B、桃花社  林黛玉","C、桃花社  薛宝钗","D、荷花社  贾宝玉"],
                result:2
            },
            {
                title:"结诗社时，林黛玉、薛宝钗、李纨起的别号分别是：",
                keys:["A、潇湘仙子  蘅芜君  稻香老农","B、潇湘妃子  蘅芜君  稻香老农","C、潇湘妃子  蘅芜君  秋爽居士","D、潇湘仙子  蕉下客  稻香老农"],
                result:2
            },
            {
                title:"“花谢花飞花满天，红消香断有谁怜？……一朝春尽红老去，花落人亡两不知！”是哪首诗中的句子？",
                keys:["A、《桃花行》","B、《芙蓉诔》","C、《菊花诗》","D、《葬花词》"],
                result:4
            }
        ],
        roleDirection:1, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [1,6],
                    [5,6]
                ]
            }
        ],
        skeleton:[ // 骷髅
        ],
        fence: { // 栅栏
            default: [
                {
                    type:0,
                    info:[
                        [9,7]
                     ]
                }
            ],
            change:[
                {
                    type:0,
                    info:[
                        [12,3]
                    ]
                }
            ]
        },
        transport:[ // 传送门
        ],
        fixed: [ // 固定物
            {
                type:3,
                position:[621,768-284]
            }
        ],
        doorOffset:[0,15], // 门的偏移
        grid:[73,73], // 网格大小
        gridOffset:[0,-10], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
			// 7 - 开关
            // 5 - 碗)
            [6,6,6,6,6,6,6,6,6,0,6,6,6,6],
            [6,6,4,6,6,4,6,0,0,2,0,6,4,6],
            [6,6,0,0,0,5,6,0,0,0,0,6,0,6],
            [3,0,0,0,6,0,4,0,0,0,6,6,0,6],
            [6,0,0,0,0,0,6,6,6,0,0,0,5,6],
            [6,6,6,0,0,0,0,0,6,0,6,0,0,6],
            [6,0,0,0,0,0,6,0,4,0,7,0,0,6],
            [6,6,6,5,6,0,6,0,6,0,6,6,6,6],
            [4,0,0,0,0,0,6,0,0,0,0,1,0,6],
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6]
        ]
    },
    { // 关卡8
        torch:[
            [169,768-119],
            [592,768-62],
            [786,768-54],
            [969,768-133],
            [63,768-247],
            [582,768-222],
            [793,768-229],
            [298,768-362],
            [676,768-409],
            [974,768-361],
            [524,768-499],
            [819,768-504],
            [81,768-584],
            [365,768-562],
            [236,768-676],
            [954,768-634]
        ],
        answer:[ // 问题列表
            {
                title:"惜春的特长是什么? ",
                keys:["A、剪纸","B、编织","C、绘画","D、音乐"],
                result:3
            },
            {
                title:"“枕霞旧友”是_______的别号，“蕉下客”是________的别号。",
                keys:["A、贾探春 史湘云","B、贾探春 贾惜春","C、史湘云 贾探春","D、贾迎春 贾探春"],
                result:3
            },
            {
                title:"贾宝玉在太虚幻境看到了金陵十二钗的判词，其中“情天情海幻情身，情既相逢必主淫。漫言不肖皆荣出，造衅开端实在宁”说的是：",
                keys:["A、秦可卿","B、袭人","C、晴雯","D、王熙凤"],
                result:1
            },
            {
                title:"“金陵十二钗”中最先病逝的是:",
                keys:["A、林黛玉","B、秦可卿","C、妙玉","D、李纨"],
                result:2
            },
            {
                title:"曹雪芹的主要生活年代：",
                keys:["A、顺治至康熙中年","B、康熙中年至雍正","C、雍正至乾隆中年","D、乾隆中年至嘉庆初年"],
                result:3
            }
        ],
        roleDirection:1, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
        ],
        skeleton:[ // 骷髅
        ],
        fence: { // 栅栏
            default: [
                {
                    type:1,
                    info:[
                        [7,6]
                    ]
                }
            ],
            change:[
                {
                    type:0,
                    info:[
                        [1,5]
                    ]
                }
            ]
        },
        transport:[ // 传送门
        ],
        fixed: [ // 固定物
        ],
        doorOffset:[25,5], // 门的偏移
        grid:[73,73], // 网格大小
        gridOffset:[2,-5], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
			// 7 - 开关
            // 5 - 碗)
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6],
            [6,4,6,6,4,6,6,6,0,0,0,0,6,6],
            [6,0,0,0,5,0,0,6,0,0,0,0,0,6],
            [6,7,6,0,0,0,0,6,0,6,6,0,0,6],
            [6,0,0,0,0,0,0,6,0,6,3,0,0,6],
            [6,0,6,6,6,6,5,6,0,6,0,6,0,6],
            [6,0,0,0,0,0,0,0,0,0,0,0,0,6],
            [6,4,2,0,6,6,6,6,0,6,0,6,6,6],
            [6,6,0,0,6,4,0,0,5,0,1,0,0,6],
            [6,6,0,6,6,6,6,6,6,6,6,6,6,6]
        ]
    },
    { // 关卡9
        torch:[
            [392,768-26],
            [669,768-45],
            [1010,768-35],
            [213,768-114],
            [828,768-134],
            [532,768-177],
            [43,768-244],
            [983,768-244],
            [204,768-312],
            [398,768-285],
            [901,768-381],
            [374,768-495],
            [661,768-494],
            [937,768-501],
            [34,768-553],
            [413,768-648],
            [836,768-647]
        ],
        answer:[ // 问题列表
            {
                title:"《红楼梦》中最长的一首诗赋是： ",
                keys:["A、《葬花词》","B、《芙蓉女儿诔》","C、《西江月》","D、《桃花行》"],
                result:2
            },
            {
                title:"秦可卿出殡时，是谁向贾政夸赞宝玉：“令郎真乃龙驹凤雏，非小王在世翁前唐突，将来‘雏凤清于老凤声’，未可量也。”？",
                keys:["A、忠靖候","B、川宁候","C、寿山伯","D、北静王"],
                result:4
            },
            {
                title:"元妃省亲是在什么节？",
                keys:["A、元宵节","B、中秋节","C、端午节","D重阳节"],
                result:1
            },
            {
                title:"“一杯为品，二杯即是解渴的蠢物，三杯便是饮牛饮驴了”是谁说的？",
                keys:["A、林黛玉","B、贾宝玉","C、妙玉","D、史湘云"],
                result:3
            },
            {
                title:"凹晶馆联诗的是哪两个人物？",
                keys:["A、薛宝钗  林黛玉","B、林黛玉  探春","C、史湘云  薛宝琴","D、林黛玉  史湘云"],
                result:4
            }
        ],
        roleDirection:2, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
        ],
        skeleton:[ // 骷髅
        ],
        fence: { // 栅栏
            default: [
                {
                    type:0,
                    info:[
                        [1,4]
                    ]
                },
                {
                    type:1,
                    info:[
                        [4,8]
                    ]
                }
            ],
            change:[
                {
                    type:1,
                    info:[
                        [4,8]
                    ]
                },
                {
                    type:0,
                    info:[
                        [11,7]
                    ]
                }
            ]
        },
        transport:[ // 传送门
        ],
        fixed: [ // 固定物
            {
                type:3,
                position:[919,768-152]
            }
        ],
        doorOffset:[10,20], // 门的偏移
        grid:[73,73], // 网格大小
        gridOffset:[-1,-14], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
			// 7 - 开关
			// 8 - 蝙蝠
            // 5 - 碗)
            [6,3,6,6,6,6,6,6,6,6,6,6,6,6],
            [6,0,6,6,0,0,0,0,0,6,0,0,2,0],
            [6,0,6,0,7,5,0,6,6,6,0,6,6,6],
            [6,0,6,0,0,0,0,0,0,0,0,0,0,6],
            [6,0,6,0,0,6,6,6,6,0,0,0,8,0],
            [6,0,0,0,0,0,0,5,0,0,0,0,6,6],
            [6,0,0,0,0,6,6,0,6,0,0,0,0,6],
            [6,0,6,6,6,6,0,0,6,6,6,0,6,6],
            [6,0,0,1,0,0,0,8,0,0,6,5,0,6],
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6]
        ]
    },
    { // 关卡10
        torch:[
            [119,768-89],
            [571,768-41],
            [785,768-31],
            [653,768-201],
            [972,768-143],
            [892,768-244],
            [88,768-263],
            [287,768-298],
            [736,768-381],
            [973,768-364],
            [796,768-424],
            [504,768-459],
            [41,768-568],
            [391,768-553],
            [223,768-633]
        ],
        answer:[ // 问题列表
            {
                title:"“满纸自怜题素怨，片言谁解诉秋心”“孤标傲世偕谁隐，一样花开为底迟”是林黛玉吟什么花的诗？ ",
                keys:["A、桂花","B、荷花","C、菊花","D、梅花"],
                result:3
            },
            {
                title:"“只有门前一对石狮子是干净的”是谁对贾府的评价：",
                keys:["A、晴雯","B、尤三姐","C、焦大","D、柳湘莲"],
                result:4
            },
            {
                title:"是谁以经过的各省古迹为题作了十首怀古诗？",
                keys:["A、薛宝钗","B、邢岫烟","C、薛宝琴","D、史湘云"],
                result:3
            },
            {
                title:"下面是宝玉在太虚幻境看到的《金陵十二钗正册》图画内容，请指出分别暗示那两个女子？①一株桂花，下面有一池沼，其中水涸泥干莲败藕枯。 ②一片冰山上有一只雌凤。",
                keys:["A、林黛玉  王熙凤","B、香菱  王熙凤","C、迎春  林黛玉","D、元春  尤三姐"],
                result:2
            },
            {
                title:"第二十二回，制灯谜贾政悲谶语。其中探春制的灯谜是：阶下儿童仰面时，清明妆点最堪宜。游丝一断浑无力，莫向东风怨别离。打一物，谜底是：",
                keys:["A、镜子","B、扇子","C、竹夫人","D、风筝"],
                result:4
            }
        ],
        roleDirection:0, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
        ],
        skeleton:[ // 骷髅
        ],
        fence: { // 栅栏
            default: [
                {
                    type:0,
                    info:[
                        [2,6]
                    ]
                },
                {
                    type:1,
                    info:[
                        [4,7]
                    ]
                }
            ],
            change:[

            ]
        },
        transport:[ // 传送门
        ],
        fixed: [ // 固定物
        ],
        doorOffset:[24,33], // 门的偏移
        grid:[74,74], // 网格大小
        gridOffset:[-20,-44], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
			// 7 - 开关
			// 8 - 蝙蝠
            // 5 - 碗)
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6],
            [6,6,0,0,6,0,3,6,4,0,0,6,6,6],
            [6,0,0,1,6,0,5,6,0,0,5,0,4,6],
            [6,0,0,0,6,0,6,6,6,0,0,0,6,6],
            [6,6,0,5,6,0,0,8,0,0,6,0,6,6],
            [6,4,0,0,6,0,0,0,0,0,6,0,0,6],
            [6,6,0,6,6,0,6,6,6,0,6,0,0,6],
            [6,6,0,0,0,0,0,7,6,0,0,0,0,6],
            [6,0,0,0,6,6,0,0,0,0,6,6,2,0],
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6]
        ]
    },
    { // 关卡11
        torch:[
            [105,768-49],
            [506,768-64],
            [656,768-64],
            [845,768-55],
            [334,768-144],
            [591,768-126],
            [975,768-134],
            [29,768-236],
            [449,768-255],
            [742,768-204],
            [975,768-271],
            [28,768-424],
            [389,768-397],
            [602,768-405],
            [768,768-407],
            [137,768-539],
            [402,768-553],
            [637,768-520],
            [757,768-503],
            [975,768-491],
            [193,768-640],
            [589,768-642],
            [882,768-642]
        ],
        answer:[ // 问题列表
            {
                title:"在抄捡大观园时，是谁不但顶撞凤姐，还打了王善保家的一记耳光？ ",
                keys:["A、探春","B、晴雯","C、惜春","D、袭人"],
                result:1
            },
            {
                title:"林黛玉最不喜欢谁的诗？",
                keys:["A、李白","B、杜甫","C、白居易","D、李商隐"],
                result:4
            },
            {
                title:"下列哪个不是《红楼梦》的别名?",
                keys:["A、情僧录","B、风月宝鉴","C、金陵十二钗","D、金玉缘"],
                result:4
            },
            {
                title:"大观园落成时，贾政等人在大观园游的第一处庭院“有凤来仪”是后来的什么地方?",
                keys:["A、怡红院","B、蘅芜院","C、缀锦阁","D、潇湘馆"],
                result:4
            },
            {
                title:"贾琏在偷娶尤二姐之后，被贾赦派去了哪儿?",
                keys:["A、维扬","B、姑苏","C、金陵","D、平安州"],
                result:4
            }
        ],
        roleDirection:2, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [2,1],
                    [6,1]
                ]
            },
            {
                "direction":1,
                "fat":[
                    [9,8],
                    [9,7]
                ]
            },
            {
                "direction":0,
                "fat":[
                    [1,3],
                    [3,3]
                ]
            }
        ],
        skeleton:[ // 骷髅
        ],
        fence: { // 栅栏
            default: [
                {
                    type:1,
                    info:[
                        [3,3]
                    ]
                },
                {
                    type:1,
                    info:[
                        [3,8]
                    ]
                }
            ],
            change:[
                {
                    type:1,
                    info:[
                        [8,6]
                    ]
                }
            ]
        },
        transport:[ // 传送门
        ],
        fixed: [ // 固定物
            {
                type:3,
                position:[240,768-146]
            },
            {
                type:3,
                position:[597,768-226]
            },
            {
                type:3,
                position:[813,768-237]
            },
            {
                type:3,
                position:[441,768-353]
            },
            {
                type:3,
                position:[492,768-517]
            },
            {
                type:3,
                position:[862,768-528]
            }
        ],
        doorOffset:[21,12], // 门的偏移
        grid:[74,74], // 网格大小
        gridOffset:[2,-5], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
			// 7 - 开关
			// 8 - 蝙蝠
			// 9 - 药瓶
            // 5 - 碗)
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6],
            [3,0,0,0,5,0,0,6,6,9,0,0,2,0],
            [6,6,6,6,6,0,0,6,0,0,0,0,6,6],
            [6,0,0,0,1,0,6,6,6,0,6,6,6,6],
            [6,0,0,6,0,0,0,0,6,0,6,0,0,6],
            [6,0,0,6,0,6,6,0,6,0,6,0,7,6],
            [6,0,0,6,0,0,0,0,0,0,0,0,5,6],
            [6,5,6,6,0,6,6,6,6,0,6,6,6,6],
            [6,0,9,0,0,0,0,9,0,0,0,0,6,6],
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6]

        ]
    },
    { // 关卡12
        torch:[
            [138,768-54],
            [409,768-54],
            [861,768-47],
            [269,768-137],
            [672,768-149],
            [838,768-149],
            [142,768-299],
            [303,768-303],
            [984,768-225],
            [572,768-376],
            [415,768-428],
            [884,768-451],
            [995,768-464],
            [149,768-541],
            [365,768-526],
            [672,768-537],
            [34,768-619],
            [303,768-686],
            [841,768-655]
        ],
        answer:[ // 问题列表
            {
                title:"“俏丫鬟抱屈夭风流 美优伶斩情归水月”一回中，“俏丫鬟”“美优伶”分别是谁？",
                keys:["A、晴雯 蕊官","B、五儿 芳官","C、金钏 藕官","D、晴雯 芳官"],
                result:4
            },
            {
                title:"“通灵宝玉”上刻的铭文是什么? ",
                keys:["A、莫失莫忘  仙寿恒昌","B、不离不弃  芳龄永继","C、你证我证  心证意证","D、不离不弃  福寿永继"],
                result:1
            },
            {
                title:"王夫人与黛玉、凤姐、宝钗的亲属关系分别是：",
                keys:["A、姑母 姨母 舅母","B、舅母 姑母 姨母","C、姨母 舅母 姑母","D、舅母 姨母 姑母"],
                result:2
            },
            {
                title:"下列奴仆中哪一个不是家生子?",
                keys:["A、袭人","B、鸳鸯","C、司棋","D、金钏"],
                result:1
            },
            {
                title:"在明清小说中，最为后人称道的莫过于《红楼梦》。（   ）曾说：“自有《红楼梦》出来以后，传统的思想和写法都打破了。”",
                keys:["A、毛泽东","B、鲁迅","C、俞平伯","D、胡适"],
                result:2
            }
        ],
        roleDirection:1, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
            {
                "direction":1, // 0 - 横向； 1 - 纵向
                "fat":[
                    [6,5],
                    [6,8]
                ]
            },
            {
                "direction":1,
                "fat":[
                    [12,4],
                    [12,7]
                ]
            }
        ],
        skeleton:[ // 骷髅
        ],
        fence: { // 栅栏
            default: [
                {
                    type:0,
                    info:[
                        [1,6]
                    ]
                },
                {
                    type:0,
                    info:[
                        [12,7]
                    ]
                }
            ],
            change:[
                {
                    type:1,
                    info:[
                        [5,8]
                    ]
                }
            ]
        },
        transport:[ // 传送门
        ],
        fixed: [ // 固定物
            {
                type:3,
                position:[404,768-285]
            },
            {
                type:3,
                position:[154,768-659]
            },
            {
                type:3,
                position:[788,768-663]
            }
        ],
        doorOffset:[13,10], // 门的偏移
        grid:[76,74], // 网格大小
        gridOffset:[-16,-24], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
			// 7 - 开关
			// 8 - 蝙蝠
			// 9 - 药瓶
            // 5 - 碗)
            [6,6,6,6,6,6,0,6,4,6,6,6,6,6],
            [6,0,0,0,0,0,2,6,0,0,0,8,0,6],
            [6,5,6,6,6,6,0,6,9,6,0,6,0,6],
            [6,1,0,0,0,0,0,0,0,6,9,6,0,6],
            [6,8,6,0,6,6,6,6,0,6,0,6,0,6],
            [6,0,6,0,9,0,0,6,7,6,0,6,0,6],
            [6,0,6,6,6,6,0,0,0,0,0,6,5,6],
            [3,0,6,0,5,6,0,6,6,6,6,6,0,6],
            [6,0,0,0,0,0,0,0,0,0,0,0,0,6],
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6]

        ]
    },
    { // 关卡13
        torch:[
            [62,768-38],
            [331,768-39],
            [571,768-42],
            [709,768-40],
            [886,768-29],
            [189,768-152],
            [487,768-165],
            [617,768-185],
            [983,768-186],
            [867,768-388],
            [978,768-431],
            [453,768-332],
            [742,768-463],
            [264,768-422],
            [55,768-427],
            [342,768-525],
            [47,768-588],
            [215,768-637],
            [859,768-656]
        ],
        answer:[ // 问题列表
            {
                title:"曹雪芹有很多个“号”，以下不是他的“号”的一项是：",
                keys:["A、芹溪","B、芹圃","C、雪芹","D、梦阮"],
                result:4
            },
            {
                title:"宝玉梦游太虚幻境时，闻到的奇香、饮的仙茶、品的美酒分别是：",
                keys:["A、群芳髓  千红一窟  万艳同杯","B、千红一窟  万艳同杯  群芳髓","C、群芳髓  万艳同杯  千红一窟","D、千红一窟  群芳髓  万艳同杯"],
                result:1
            },
            {
                title:"在贾府中，是谁痛骂袭人是“忘了本的小娼妇”，“装狐媚子哄宝玉”？ ",
                keys:["A、王善保家的","B、赵姨娘","C、秋桐","D、李嬷嬷"],
                result:4
            },
            {
                title:"下列都是咏海棠的诗，那句是林黛玉写的？",
                keys:["A、玉是精神难比洁，雪为肌骨易销魂","B、胭脂洗出秋阶影，冰雪招来露砌魂","C、偷来梨蕊三分白，借得梅花一缕魂","D、出浴太真冰作影，捧心西子玉为魂"],
                result:3
            },
            {
                title:"下列评价分别对应的是哪一个人物？①世外仙姝寂寞林 ②天生成孤僻人皆罕 ③山中高士晶莹雪 ④英豪阔大宽宏量",
                keys:["A、黛玉 宝钗 湘云 妙玉","B、黛玉 宝琴 妙玉 湘云","C、黛玉 妙玉 宝钗 湘云","D、黛玉 探春 妙玉 宝钗"],
                result:3
            }
        ],
        roleDirection:1, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [3,8],
                    [5,8]
                ]
            }
        ],
        skeleton:[ // 骷髅
        ],
        fence: { // 栅栏
            default: [
                {
                    type:0,
                    info:[
                        [5,7]
                    ]
                },
                {
                    type:0,
                    info:[
                        [2,7]
                    ]
                }
            ],
            change:[
                {
                    type:0,
                    info:[
                        [1,3]
                    ]
                }
            ]
        },
        transport:[ // 传送门
        ],
        fixed: [ // 固定物
        ],
        doorOffset:[27,15], // 门的偏移
        grid:[74,74], // 网格大小
        gridOffset:[-13,-24], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
			// 7 - 开关
			// 8 - 蝙蝠
			// 9 - 药瓶
            // 5 - 碗)
            [6,6,6,6,6,6,6,6,6,6,6,0,6,6],
            [6,5,4,0,8,0,3,6,4,9,0,2,0,6],
            [6,0,6,6,6,0,6,4,6,0,0,6,0,6],
            [6,0,6,0,0,0,0,0,0,0,0,6,0,6],
            [6,0,0,7,0,0,6,6,0,0,9,6,0,6],
            [6,0,0,0,0,0,0,6,0,5,6,6,0,6],
            [6,1,0,6,0,0,0,0,0,0,6,0,0,6],
            [6,6,0,6,6,0,6,6,0,0,0,0,0,6],
            [6,5,0,0,0,0,6,6,4,6,0,0,0,6],
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6]

        ]
    },
    { // 关卡14
        torch:[
            [59,768-26],
            [331,768-24],
            [569,768-28],
            [888,768-17],
            [191,768-147],
            [421,768-162],
            [575,768-170],
            [812,768-191],
            [989,768-179],
            [43,768-344],
            [196,768-345],
            [421,768-358],
            [536,768-477],
            [871,768-426],
            [979,768-423],
            [343,768-517],
            [47,768-564],
            [207,768-654],
            [438,768-646],
            [762,768-595],
            [987,768-594]
        ],
        answer:[ // 问题列表
            {
                title:"在第三十五回中，莺儿为宝玉结了一个什么花样的丝络? ",
                keys:["A、柳叶","B、方胜","C、双飞燕","D、攒心梅花"],
                result:4
            },
            {
                title:"第三十九回，贾母笑道：“凤丫头别拿他取笑儿。他是乡屯里的人，老实，那里搁的住你打趣他。”“他”指的是谁?",
                keys:["A、周姨娘","B、赖大家的","C、刘姥姥","D、李嬷嬷"],
                result:3
            },
            {
                title:"刘姥姥进大观园时，妙玉为贾母奉上的是什么茶、什么水？",
                keys:["A、枫露茶  露水","B、老君眉 雨水","C、碧螺春 雪水","D、六安茶 雪水"],
                result:2
            },
            {
                title:"宝玉深深同情的、夹在“贾琏之俗，凤姐之威”当中的人物是：",
                keys:["A、平儿","B、尤二姐","C、秋桐","D、迎春"],
                result:1
            },
            {
                title:"晴雯病中连夜为宝玉补好了：",
                keys:["A、紫貂裘","B、红狐裘","C、孔雀裘","D、雀金裘"],
                result:4
            }
        ],
        roleDirection:1, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [8,5],
                    [12,5]
                ]
            },
            {
                "direction":1,
                "fat":[
                    [12,1],
                    [12,4]
                ]
            }
        ],
        skeleton:[ // 骷髅
            {
                "direction":1, // 0 - 横向； 1 - 纵向
                "fat":[
                    [3,6],
                    [3,1]
                ]
            }
        ],
        fence: { // 栅栏
            default: [
                {
                    type:0,
                    info:[
                        [6,5]
                    ]
                },
                {
                    type:1,
                    info:[
                        [4,8]
                    ]
                }
            ],
            change:[
                {
                    type:1,
                    info:[
                        [7,3]
                    ]
                },
                {
                    type:1,
                    info:[
                        [10,5]
                    ]
                }
            ]
        },
        transport:[ // 传送门
        ],
        fixed: [ // 固定物
            {
                type:4,
                position:[758,768-136]
            },
            {
                type:4,
                position:[616,768-451]
            }
        ],
        doorOffset:[34,18], // 门的偏移
        grid:[74,74], // 网格大小
        gridOffset:[-13,-24], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
			// 7 - 开关
			// 8 - 蝙蝠
			// 9 - 药瓶
            // 5 - 碗)
            [6,6,0,6,6,6,6,6,6,6,6,6,6,6],
            [6,0,2,7,0,6,0,5,0,0,0,1,0,3],
            [6,0,6,0,0,6,0,6,0,6,6,0,0,6],
            [6,0,5,0,0,0,0,0,0,0,6,0,0,6],
            [6,0,6,0,0,4,0,6,0,0,6,6,0,6],
            [6,0,6,0,0,6,0,6,0,0,0,0,0,6],
            [6,0,0,0,0,0,0,6,6,0,6,6,0,6],
            [6,6,6,6,6,6,0,0,6,0,6,0,0,6],
            [6,9,0,0,0,0,0,0,0,0,6,5,0,6],
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6]

        ]
    },
    { // 关卡15
        torch:[
            [52,768-39],
            [321,768-40],
            [561,768-41],
            [878,768-31],
            [208,768-162],
            [519,768-148],
            [806,768-180],
            [981,768-198],
            [399,768-221],
            [34,768-361],
            [201,768-365],
            [409,768-373],
            [848,768-322],
            [198,768-488],
            [331,768-535],
            [527,768-498],
            [971,768-436],
            [33,768-583],
            [429,768-646],
            [683,768-645],
            [979,768-614]
        ],
        answer:[ // 问题列表
            {
                title:"第四十九和五十二回写宝琴所披凫靥裘，就是什么动物头上的毛作的？",
                keys:["A、鸳鸯","B、雉鸡","C、孔雀","D、野鸭子"],
                result:4
            },
            {
                title:"“这鸭头不是那丫头，头上那讨桂花油”是谁说的酒令？",
                keys:["A、王熙凤","B、史湘云","C、薛宝钗","D、老太君"],
                result:2
            },
            {
                title:"“投鼠忌器宝玉瞒赃”中“投鼠忌器”一语指的是什么?",
                keys:["A、追究五儿连累芳官","B、查到赵姨娘伤害探春","C、维护柳妈得罪司棋","D、查办彩云带出贾环"],
                result:2
            },
            {
                title:"“幽淑女悲题五美吟”，不属于“五美” 的人物是：",
                keys:["A、虞姬","B、绿珠","C、红拂","D、貂蝉"],
                result:4
            },
            {
                title:"第三十九回，李纨道：“凤丫头就是楚霸王，也得这两只膀子好举千斤鼎。他不是这丫头，就得这么周到了?”“这丫头”指的是谁? ",
                keys:["A、小红","B、司棋","C、平儿","D、袭人"],
                result:3
            }
        ],
        roleDirection:1, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [10,1],
                    [11,1]
                ]
            }
        ],
        skeleton:[ // 骷髅
            {
                "direction":1, // 0 - 横向； 1 - 纵向
                "fat":[
                    [8,3],
                    [8,6]
                ]
            }
        ],
        fence: { // 栅栏
            default: [
                {
                    type:0,
                    info:[
                        [1,6]
                    ]
                },
                {
                    type:1,
                    info:[
                        [5,6]
                    ]
                },
                {
                    type:1,
                    info:[
                        [5,8]
                    ]
                },
                {
                    type:1,
                    info:[
                        [9,1]
                    ]
                },
                {
                    type:0,
                    info:[
                        [10,4]
                    ]
                }
            ],
            change:[
            ]
        },
        transport:[ // 传送门
        ],
        fixed: [ // 固定物
            {
                type:4,
                position:[639,768-503]
            },
            {
                type:4,
                position:[482,768-345]
            },
            {
                type:4,
                position:[897,768-142]
            }
        ],
        doorOffset:[33,25], // 门的偏移
        grid:[74,74], // 网格大小
        gridOffset:[-27,-24], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
			// 7 - 开关
			// 8 - 蝙蝠
			// 9 - 药瓶
            // 5 - 碗)
            [6,6,6,6,6,0,6,6,6,6,6,6,6,6],
            [6,0,0,0,0,2,0,6,4,0,0,0,5,6],
            [6,4,0,6,4,0,0,6,0,6,0,6,6,6],
            [6,6,5,6,6,6,0,6,0,6,0,0,0,6],
            [6,0,0,0,1,6,9,0,0,6,0,6,0,6],
            [6,0,0,6,0,6,6,6,0,6,0,6,0,6],
            [6,0,6,6,0,0,0,0,7,0,0,6,0,6],
            [6,0,0,6,6,6,0,6,6,6,6,6,0,6],
            [6,0,5,0,0,0,0,0,0,0,3,0,0,6],
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6]

        ]
    },
    { // 关卡16
        torch:[
            [56,768-55],
            [327,768-53],
            [565,768-58],
            [885,768-43],
            [375,768-192],
            [592,768-188],
            [797,768-180],
            [967,768-188],
            [68,768-351],
            [203,768-373],
            [462,768-384],
            [797,768-293],
            [203,768-502],
            [341,768-547],
            [535,768-505],
            [962,768-453],
            [57,768-586],
            [425,768-638],
            [763,768-635],
            [893,768-629]
        ],
        answer:[ // 问题列表
            {
                title:"抄检大观园时，唯一没有被抄检的院落是：",
                keys:["A、潇湘馆","B、蘅芜苑","C、怡红院","D、稻香村"],
                result:2
            },
            {
                title:"“制灯谜贾政悲谶语”一回中，元春所制的灯谜，有谁没有猜中？",
                keys:["A、迎春  惜春","B、迎春 贾环","C、宝玉 贾兰","D、贾环 贾兰"],
                result:2
            },
            {
                title:" “可知这样大族人家，若从外头杀来，一时是杀不死的，这是古人曾说的‘百足之虫，死而不僵’，必须先从家里自杀自灭起来，才能一败涂地！”此话是谁说的？",
                keys:["A、贾政","B、贾琏","C、王熙凤","D、探春"],
                result:4
            },
            {
                title:"“千里搭长棚，没有个不散的筵席”和“盛筵必散”分别是谁说的?",
                keys:["A、小红  黛玉","B、探春  晴雯","C、小红  秦可卿","D、探春  黛玉"],
                result:3
            },
            {
                title:"“红学”一词是在什么时候出现的？",
                keys:["A、乾隆年间","B、嘉庆年间","C、清末","D、“五四”前后"],
                result:3
            }
        ],
        roleDirection:0, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
            {
                "direction":1, // 0 - 横向； 1 - 纵向
                "fat":[
                    [1,3],
                    [1,3]
                ]
            },
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [2,8],
                    [4,8]
                ]
            }
        ],
        skeleton:[ // 骷髅
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [8,6],
                    [4,6]
                ]
            }
        ],
        fence: { // 栅栏
            default: [
                {
                    type:1,
                    info:[
                        [8,1]
                    ]
                }
            ],
            change:[
                {
                    type:1,
                    info:[
                        [2,6]
                    ]
                },
                {
                    type:1,
                    info:[
                        [6,6]
                    ]
                }
            ]
        },
        transport:[ // 传送门
        ],
        fixed: [ // 固定物
            {
                type:4,
                position:[478,768-489]
            },
            {
                type:4,
                position:[184,768-338]
            },
            {
                type:4,
                position:[619,768-133]
            }
        ],
        doorOffset:[20,-2], // 门的偏移
        grid:[74,74], // 网格大小
        gridOffset:[-13,-24], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
			// 7 - 开关
			// 8 - 蝙蝠
			// 9 - 药瓶
            // 5 - 碗)
            [6,4,6,6,6,6,6,6,6,6,6,6,6,6],
            [6,0,9,0,0,0,0,0,0,0,0,0,1,6],
            [6,0,0,6,0,6,0,0,6,6,6,4,6,6],
            [6,0,6,6,0,0,6,0,0,0,0,0,0,6],
            [6,5,0,0,0,0,6,0,6,0,6,0,0,6],
            [6,6,6,0,0,0,6,0,6,0,6,0,0,6],
            [6,5,0,0,7,0,0,9,0,0,0,5,0,6],
            [6,0,6,6,6,0,6,6,6,0,6,0,0,6],
            [6,0,0,0,0,0,0,4,6,0,0,2,0,6],
            [6,3,6,6,6,6,6,6,6,6,6,0,6,6]

        ]
    },
    { // 关卡17
        torch:[
            [328,768-54],
            [565,768-50],
            [885,768-45],
            [191,768-170],
            [335,768-187],
            [589,768-185],
            [967,768-185],
            [41,768-347],
            [204,768-366],
            [461,768-338],
            [808,768-293],
            [322,768-479],
            [523,768-480],
            [742,768-484],
            [962,768-451],
            [58,768-589],
            [646,768-599],
            [869,768-594],
            [391,768-663]
        ],
        answer:[ // 问题列表
            {
                title:"《红楼梦》中涉及的外国地名中哪一个是虚拟的？",
                keys:["A、暹罗","B、海西福朗思牙","C、茜香","D、波斯"],
                result:3
            },
            {
                title:"“昵而敬之，恐拂其意，爱博而心劳，而忧患亦日甚矣。”是鲁迅先生对哪个人物的评论？",
                keys:["A、林黛玉","B、贾宝玉","C、贾元春","D、薛宝钗"],
                result:2
            },
            {
                title:"《红楼梦》中作者善于用环境来衬托人物性格，“有千百竿翠竹遮掩”、“竿竿青欲滴，个个绿生凉”描写的是（   ）的住所；房外“异香扑鼻，那些奇草仙藤，愈冷愈苍翠”，房内“是雪洞一般，一色器物全无”描写的是（   ）的住所；三间屋子不曾隔断、案上满满的都是“名人法帖、宝砚、各色笔筒”，还有米芾的《烟雨图》的是（   ）的住所。",
                keys:["A 林黛玉 薛宝钗 贾探春","B 薛宝钗 林黛玉 史湘云","C 林黛玉 贾探春 贾宝玉","D 贾探春 薛宝钗 贾宝玉"],
                result:1
            },
            {
                title:"宝玉黛玉共读《会真记》的地点在：",
                keys:["A、沁芳桥","B、凸碧堂","C、柳叶渚","D、蜂腰桥"],
                result:1
            },
            {
                title:"“铁甲长戈死未忘，堆盘色相喜先尝”“眼前道路无经纬，皮里春秋空黑黄”两联诗分别是谁作的？写的是什么？",
                keys:["A、贾宝玉  薛宝钗  虾子","B、薛宝钗  林黛玉  螃蟹","C、林黛玉  薛宝钗  螃蟹","D、贾宝玉  林黛玉  虾子"],
                result:3
            }
        ],
        roleDirection:1, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
        ],
        skeleton:[ // 骷髅
        ],
        fence: { // 栅栏
            default: [
                {
                    type:1,
                    info:[
                        [4,3]
                    ]
                },
                {
                    type:0,
                    info:[
                        [5,4]
                    ]
                }
            ],
            change:[
            ]
        },
        transport:[ // 传送门
            {
                "type":1, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [3,1],
                    [10,5]
                ]
            },
            {
                "type":1, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [10,5],
                    [3,1]
                ]
            }
        ],
        fixed: [ // 固定物
            {
                type:4,
                position:[471,768-444]
            },
            {
                type:4,
                position:[665,768-275]
            },
            {
                type:4,
                position:[271,768-314]
            }
        ],
        doorOffset:[15,40], // 门的偏移
        grid:[74,74], // 网格大小
        gridOffset:[-39,-8], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
			// 7 - 开关
			// 8 - 蝙蝠
			// 9 - 药瓶
            // 5 - 碗
            // 10 - 传送门)
            [6,6,6,6,6,3,6,6,6,6,2,6,6,6],
            [6,6,6,0,6,0,6,5,0,0,0,0,4,6],
            [6,0,6,7,6,0,6,0,6,0,0,6,6,6],
            [6,0,0,0,0,0,0,0,6,0,0,0,0,6],
            [6,1,6,6,6,0,6,6,6,6,0,6,0,6],
            [6,0,4,6,6,0,0,0,5,6,0,6,0,6],
            [6,0,0,0,6,0,6,6,6,6,6,6,0,6],
            [6,0,0,0,0,0,6,0,0,0,0,0,0,6],
            [6,6,0,0,5,0,0,0,6,6,6,6,6,6],
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6]

        ]
    },
    { // 关卡18
        torch:[
            [58,768-53],
            [328,768-53],
            [884,768-46],
            [967,768-190],
            [966,768-454],
            [873,768-510],
            [719,768-401],
            [643,768-540],
            [540,768-479],
            [682,768-137],
            [503,768-139],
            [402,768-179],
            [332,768-190],
            [280,768-332],
            [254,768-592],
            [60,768-586],
            [41,768-419],
            [452,768-652]
        ],
        answer:[ // 问题列表
            {
                title:"香菱学诗，黛玉推荐她首先读的诗集是：",
                keys:["A、《杜工部集》","B、《王摩诘全集》","C、《白氏长庆集》","D、《稼轩长短句》"],
                result:2
            },
            {
                title:"宝玉给哪个丫头起名为“耶律雄奴”?",
                keys:["A、晴雯","B、芳官","C、小红","D、袭人"],
                result:2
            },
            {
                title:"根据书中描写，在模样和性格上与林黛玉相似的人有（　　）和（    ）",
                keys:["A 晴雯 芳官","B 晴雯  龄官","C 金钏儿 四儿","D  晴雯  金钏儿"],
                result:2
            },
            {
                title:"芳官送给柳五儿的是什么？",
                keys:["A、蔷薇硝","B、茉莉粉","C、玫瑰露","D、茯苓霜"],
                result:3
            },
            {
                title:"下列诗词的作者是：①《杏帘在望》　②《秋夜即事》　③《如梦令》　④《残菊》",
                keys:["A、宝玉 黛玉 探春 湘云","B、宝钗 黛玉 湘云 宝玉","C、宝玉 黛玉 湘云 宝钗","D、黛玉 宝玉 湘云 探春"],
                result:4
            }
        ],
        roleDirection:1, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [3,3],
                    [3,3]
                ]
            },
            {
                "direction":1, // 0 - 横向； 1 - 纵向
                "fat":[
                    [4,4],
                    [4,7]
                ]
            }
        ],
        skeleton:[ // 骷髅
        ],
        fence: { // 栅栏
            default: [
                {
                    type:1,
                    info:[
                        [11,4]
                    ]
                }
            ],
            change:[
                {
                    type:0,
                    info:[
                        [12,3]
                    ]
                }
            ]
        },
        transport:[ // 传送门
            {
                "type":0, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [6,1],
                    [10,1]
                ]
            },
            {
                "type":0, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [10,1],
                    [6,1]
                ]
            }
        ],
        fixed: [ // 固定物
            {
                type:4,
                position:[347,768-154]
            }
        ],
        doorOffset:[12,27], // 门的偏移
        grid:[75,75], // 网格大小
        gridOffset:[-8,-12], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
			// 7 - 开关
			// 8 - 蝙蝠
			// 9 - 药瓶
            // 5 - 碗)
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6],
			[6,4,3,0,0,0,0,6,0,7,0,6,4,6],
			[6,0,0,6,6,6,6,6,0,6,5,6,0,6],
			[6,6,0,0,0,0,0,4,0,6,0,6,0,6],
			[6,6,6,6,0,0,0,6,0,0,0,0,5,6],
			[6,6,0,0,0,0,5,4,6,6,4,6,0,6],
			[6,0,0,6,0,6,0,6,4,9,0,0,1,6],
			[6,0,0,0,0,0,0,6,6,0,0,6,0,6],
			[6,2,6,6,6,6,0,0,0,0,6,6,0,6],
			[6,0,6,6,6,6,6,6,6,6,6,6,6,6]
        ]
    },
    { // 关卡19
        torch:[
            [52,768-155],
            [248,768-119],
            [263,768-48],
            [610,768-45],
            [546,768-143],
            [654,768-235],
            [774,768-147],
            [870,768-354],
            [971,768-326],
            [382,768-247],
            [250,768-320],
            [61,768-487],
            [389,768-457],
            [481,768-558],
            [747,768-513],
            [966,768-611],
            [55,768-628]
        ],
        answer:[ // 问题列表
            {
                title:"下列别号和人物的关系：①蕉下客  ②枕霞旧友  ③绛洞花主  ④藕榭",
                keys:["A、探春 湘云 宝玉 惜春","B、湘云 宝钗 李纨 惜春","C、探春 宝玉 黛玉 惜春","D、探春 湘云 李纨 惜春"],
                result:1
            },
            {
                title:"下列对联挂在何处：①世事洞明皆学问，人情练达即文章 ②假作真时真亦假，无为有处有还无 ③烟霞闲骨格，泉石野生涯 ④勋业有光昭日月，功名无间及儿孙",
                keys:["A、探春卧室 太虚幻境 林黛玉卧室 贾政上房","B、秦可卿上房 太虚幻境 林黛玉卧室 贾政上房","C、秦可卿上房 太虚幻境  探春卧室 贾府宗祠","D、探春卧室 太虚幻境 林黛玉卧室 贾府宗祠"],
                result:3
            },
            {
                title:"下列回目与人物的关系：①滴翠亭杨妃戏彩蝶 ②秋爽斋偶结海棠社 ③风雨夕闷制风雨词 ④薛小妹新编怀古诗",
                keys:["A、宝钗  探春 李纨 宝琴","B、宝钗 探春 黛玉 宝琴","C、宝琴  李纨 黛玉 宝钗","D、宝钗 宝玉 黛玉 宝琴"],
                result:2
            },
            {
                title:"下列诗句暗示何人命运：①清明涕送江边望，千里东风一梦遥 ②一声震得人方恐，回首相看已成灰 ③焦首朝朝还暮暮，煎心日日复年年 ④云散高唐，水涸湘江",
                keys:["A、宝钗 湘云　元春　探春","B、探春 凤姐 黛玉 湘云","C、探春 元春  宝钗  湘云","D、探春 凤姐 黛玉 湘云"],
                result:3
            },
            {
                title:"下列花名与花签的对应关系：①只恐夜深花睡去 ②竹篱茅舍自甘心 ③任是无情也动人 ④莫怨东风当自嗟",
                keys:["A、海棠 梅花 牡丹 芙蓉","B、海棠 菊花 牡丹 莲花","C、海棠 百合 牡丹 芙蓉","D、梅花 菊花 牡丹 水仙"],
                result:1
            }
        ],
        roleDirection:1, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [4,3],
                    [4,3]
                ]
            }
        ],
        skeleton:[ // 骷髅
            {
                "direction":1, // 0 - 横向； 1 - 纵向
                "fat":[
                    [8,5],
                    [8,1]
                ]
            }
        ],
        fence: { // 栅栏
            default: [
                {
                    type:1,
                    info:[
                        [3,5]
                    ]
                },
                {
                    type:1,
                    info:[
                        [10,1]
                    ]
                },
                {
                    type:0,
                    info:[
                        [12,6]
                    ]
                }
            ],
            change:[
                {
                    type:0,
                    info:[
                        [1,2]
                    ]
                }
            ]
        },
        transport:[ // 传送门
            {
                "type":0, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [12,8],
                    [6,5]
                ]
            },
            {
                "type":0, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [6,5],
                    [12,8]
                ]
            },
            {
                "type":1, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [4,1],
                    [1,6]
                ]
            },
            {
                "type":1, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [1,6],
                    [4,1]
                ]
            }
        ],
        fixed: [ // 固定物
        ],
        doorOffset:[24,28], // 门的偏移
        grid:[73,69], // 网格大小
        gridOffset:[-6,-10], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
			// 7 - 开关
			// 8 - 蝙蝠
			// 9 - 药瓶
            // 5 - 碗)
            [6,6,6,6,6,6,6,6,6,6,6,3,6,6],
			[6,6,6,6,0,0,0,0,7,0,0,0,0,6],
			[6,4,6,6,1,0,0,6,0,0,6,5,0,6],
			[6,0,0,6,0,6,0,6,6,0,6,6,0,6],
			[6,5,0,6,0,0,0,6,0,0,0,6,0,6],
			[6,0,0,0,9,0,0,6,0,5,0,6,0,6],
			[6,0,4,6,0,6,6,6,6,0,0,6,0,6],
			[6,6,6,6,0,0,0,0,0,0,6,6,0,6],
			[6,2,0,0,0,0,6,0,0,0,0,0,0,6],
			[6,6,6,6,6,6,6,6,6,6,6,6,6,6]
        ]
    },
    { // 关卡20
        torch:[
            [93,768-49],
            [446,768-49],
            [806,768-33],
            [925,768-38],
            [958,768-145],
            [792,768-162],
            [652,768-162],
            [40,768-241],
            [357,768-315],
            [607,768-332],
            [453,768-340],
            [757,768-326],
            [985,768-323],
            [748,768-459],
            [586,768-541],
            [425,768-526],
            [272,768-582],
            [39,768-574],
            [465,768-643],
            [660,768-642],
            [834,768-644]
        ],
        answer:[ // 问题列表
            {
                title:"下列诗句与作者的关系：①胭脂洗出秋阶影，冰雪招来露砌魂。 ②博得嫦娥应借问，缘何不使永团圆。 ③未若锦囊收艳骨，一杯净土掩风流。④霜清纸帐来新梦，圃冷斜阳忆旧游。",
                keys:["A、宝钗 香菱 黛玉 湘云","B、探春 湘云 黛玉 宝钗","C、宝钗 香菱 黛玉 探春","D、宝钗 香菱 黛玉 探春"],
                result:1
            },
            {
                title:"下列咏菊花诗与作者的关系：①霜前月下谁家种，槛外篱边何处秋。②数去更无君傲世，看来唯有我知音。　③空篱旧圃秋无迹，瘦月清霜梦有知。④短鬓冷沾三径露，葛巾香染九秋霜。",
                keys:["A、怡红公子 枕霞旧友 蘅芜君 蕉下客","B、怡红公子 潇湘妃子 蘅芜君 蕉下客","C、潇湘妃子 枕霞旧友 蕉下客 蘅芜君","D、怡红公子 潇湘妃子 蕉下客 枕霞旧友"],
                result:1
            },
            {
                title:"第二十八回谈到林黛玉的病，王夫人道：“前儿大夫说了个丸药的名字，我也忘了。”宝钗在旁边说了哪种药名?",
                keys:["A、天王补心丹","B、金刚丸","C、八珍益母丸","D、菩萨散"],
                result:1
            },
            {
                title:"下列形容词与人物的关系：①紫鹃　②凤姐　③香菱　④探春",
                keys:["A、忠 辣 憨 敏","B、慧 酸 呆 敏 ","C、忠 辣 呆 俏","D、敏 酸 呆 慧"],
                result:2
            },
            {
                title:"《红楼梦》的官职中哪个是清代实有之职?",
                keys:["A、永兴节度史","B、五城兵马司","C、金陵省体仁院总裁","D、大明宫掌宫内相"],
                result:2
            }
        ],
        roleDirection:1, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
            {
                "direction":1, // 0 - 横向； 1 - 纵向
                "fat":[
                    [3,1],
                    [3,3]
                ]
            },
            {
                "direction":1, // 0 - 横向； 1 - 纵向
                "fat":[
                    [5,1],
                    [5,3]
                ]
            },
            {
                "direction":1, // 0 - 横向； 1 - 纵向
                "fat":[
                    [11,1],
                    [11,3]
                ]
            }
        ],
        skeleton:[ // 骷髅
            {
                "direction":1, // 0 - 横向； 1 - 纵向
                "fat":[
                    [10,7],
                    [10,1]
                ]
            }
        ],
        fence: { // 栅栏
            default: [
                {
                    type:0,
                    info:[
                        [3,4]
                    ]
                },
                {
                    type:0,
                    info:[
                        [5,4]
                    ]
                },
                {
                    type:0,
                    info:[
                        [7,4]
                    ]
                },
                {
                    type:0,
                    info:[
                        [9,4]
                    ]
                },
                {
                    type:0,
                    info:[
                        [11,4]
                    ]
                },
                {
                    type:1,
                    info:[
                        [4,1]
                    ]
                },
                {
                    type:1,
                    info:[
                        [8,1]
                    ]
                }
            ],
            change:[
            ]
        },
        transport:[ // 传送门
            {
                "type":0, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [1,3],
                    [12,1]
                ]
            },
            {
                "type":0, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [12,1],
                    [1,3]
                ]
            },
            {
                "type":1, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [1,1],
                    [8,8]
                ]
            },
            {
                "type":1, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [8,8],
                    [1,1]
                ]
            }
        ],
        fixed: [ // 固定物
            {
                type:5,
                position:[490,768-635]
            },
            {
                type:5,
                position:[994,768-151]
            }
        ],
        doorOffset:[35,5], // 门的偏移
        grid:[73,69], // 网格大小
        gridOffset:[-4,5], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
			// 7 - 开关
			// 8 - 蝙蝠
			// 9 - 药瓶
            // 5 - 碗
            // 10 - 开关)
            [6,6,6,6,6,6,6,6,6,6,6,3,6,6],
			[6,0,8,0,0,0,0,0,0,0,7,0,0,6],
			[6,0,6,0,6,0,6,0,6,1,6,0,6,6],
			[6,10,0,5,0,0,0,5,6,0,0,5,6,6],
			[6,0,6,0,6,0,6,0,6,0,6,0,6,6],
			[6,0,0,4,0,4,0,4,0,0,6,6,0,6],
			[6,0,6,6,6,6,6,6,0,6,6,6,6,6],
			[6,0,9,0,0,6,0,6,0,0,0,0,0,6],
			[6,2,0,6,0,9,0,0,10,0,0,8,0,6],
			[6,6,6,6,6,6,6,6,6,6,6,6,6,6]
        ]
    },
    { // 关卡21
        torch:[
            [57,768-103],
            [306,768-69],
            [477,768-67],
            [645,768-66],
            [844,768-52],
            [991,768-191],
            [898,768-321],
            [775,768-285],
            [540,768-285],
            [56,768-299],
            [262,768-357],
            [649,768-372],
            [538,768-444],
            [60,768-434],
            [199,768-519],
            [295,768-639],
            [56,768-613],
            [707,768-505],
            [859,768-623],
            [942,768-463]
        ],
        answer:[ // 问题列表
            {
                title:"存放在苏联亚洲人民研究所列宁格勒分所的《红楼梦》抄本是哪种？",
                keys:["A、蒙府本","B、庚辰本","C、舒元炜序本","D、列藏本"],
                result:4
            },
            {
                title:"《红楼梦》曾在哪国被改编成歌剧上演？",
                keys:["A、苏联","B、日本","C、朝鲜","D、新加坡"],
                result:3
            },
            {
                title:"第四十二回写巧姐着了凉，发起热来。刘姥姥叫平儿拿出一本什么书来念？",
                keys:["A、《玉匣记》","B、《玉剑尊闻》","C、《山堂肆考》","D、《列女传》"],
                result:1
            },
            {
                title:"曹家祖孙三代有四人先后担任过江宁织造，其次序应是下面哪一个? ",
                keys:["A、曹寅、曹玺、曹頫、曹颙","B、曹玺、曹寅、曹頫、曹颙","C、曹寅、曹玺、曹颙、曹頫","D、曹玺、曹寅、曹颙、曹頫"],
                result:2
            },
            {
                title:"香菱的本名？",
                keys:["A、贾元春","B、史湘云","C、甄英莲","D、李纨"],
                result:3
            }
        ],
        roleDirection:1, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [3,3],
                    [6,3]
                ]
            },
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [4,8],
                    [5,8]
                ]
            },
            {
                "direction":1, // 0 - 横向； 1 - 纵向
                "fat":[
                    [10,6],
                    [10,8]
                ]
            }
        ],
        skeleton:[ // 骷髅
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [4,1],
                    [9,1]
                ]
            }
        ],
        fence: { // 栅栏
            default: [
                {
                    type:1,
                    info:[
                        [3,8]
                    ]
                },
                {
                    type:1,
                    info:[
                        [10,1]
                    ]
                },
                {
                    type:1,
                    info:[
                        [10,3]
                    ]
                }
            ],
            change:[
                {
                    type:1,
                    info:[
                        [2,1]
                    ]
                },
                {
                    type:1,
                    info:[
                        [2,3]
                    ]
                },
                {
                    type:0,
                    info:[
                        [9,4]
                    ]
                },
                {
                    type:0,
                    info:[
                        [11,4]
                    ]
                }
            ]
        },
        transport:[ // 传送门
            {
                "type":0, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [0,3],
                    [12,3]
                ]
            },
            {
                "type":0, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [12,3],
                    [0,3]
                ]
            }
        ],
        fixed: [ // 固定物
        ],
        doorOffset:[-3,33], // 门的偏移
        grid:[73,67], // 网格大小
        gridOffset:[7,4], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
			// 7 - 开关
			// 8 - 蝙蝠
			// 9 - 药瓶
            // 5 - 碗)
            [6,6,6,6,6,6,6,6,6,6,6,6,4,6],
			[6,5,0,0,0,6,0,0,0,7,0,0,0,6],
			[6,0,6,0,0,0,0,0,0,0,6,0,0,6],
			[0,1,0,0,0,0,0,0,0,0,0,0,0,6],
			[6,6,6,0,0,2,0,6,6,0,6,0,6,6],
			[6,6,6,6,0,0,0,6,6,9,0,0,0,6],
			[6,3,5,6,0,0,0,6,0,0,0,5,0,6],
			[6,0,6,6,9,0,0,0,0,6,0,0,6,6],
			[6,0,0,0,0,0,6,0,0,0,0,4,6,6],
			[6,6,6,6,6,6,6,6,6,6,6,6,6,6]
        ]
    },
    { // 关卡22
        torch:[
            [25,768-81],
            [33,768-320],
            [108,768-584],
            [383,768-655],
            [303,768-516],
            [303,768-331],
            [150,768-382],
            [188,768-229],
            [182,768-120],
            [339,768-143],
            [297,768-20],
            [500,768-32],
            [629,768-122],
            [698,768-454],
            [490,768-350],
            [493,768-510],
            [626,768-667],
            [908,768-657],
            [877,768-490],
            [790,768-304],
            [998,768-423],
            [991,768-240],
            [967,768-16],
            [778,768-160]
        ],
        answer:[ // 问题列表
            {
                title:"“不是东风压了西风，就是西风压了东风”一语出于《红楼梦》中何人之口？",
                keys:["A、凤姐","B、贾母","C、探春","D、林黛玉"],
                result:4
            },
            {
                title:"《红楼梦》中凤姐讲“聋子放炮仗”的笑话是在什么节日？",
                keys:["A、除夕","B、中秋","C、端午","D、元宵"],
                result:4
            },
            {
                title:"“蜂腰桥设言传心事”中的主要人物是谁?",
                keys:["A、小红","B、司棋","C、晴雯","D、金钏"],
                result:1
            },
            {
                title:"茅檐土壁，槿篱竹牖”描写的是大观园中何处建筑？",
                keys:["A、稻香村","B、芦雪庵","C、潇湘馆","D、蘅芜院"],
                result:2
            },
            {
                title:"第七十九回写宝玉的《芙蓉女儿诔》得到林黛玉的夸奖，并认为这篇诔文可与什么相并?",
                keys:["A、曹娥碑","B、秦观的《淮海集》","C、王维的《西施咏》","D、《后汉书·曹硪传》"],
                result:1
            }
        ],
        roleDirection:1, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [6,3],
                    [8,3]
                ]
            },
            {
                "direction":1, // 0 - 横向； 1 - 纵向
                "fat":[
                    [12,5],
                    [12,7]
                ]
            }
        ],
        skeleton:[ // 骷髅
            {
                "direction":1, // 0 - 横向； 1 - 纵向
                "fat":[
                    [3,6],
                    [3,1]
                ]
            }
        ],
        fence: { // 栅栏
            default: [
                {
                    type:0,
                    info:[
                        [1,3]
                    ]
                },
                {
                    type:0,
                    info:[
                        [5,5]
                    ]
                },
                {
                    type:0,
                    info:[
                        [12,7]
                    ]
                },
                {
                    type:1,
                    info:[
                        [2,4]
                    ]
                },
                {
                    type:1,
                    info:[
                        [9,9]
                    ]
                }
            ],
            change:[
                {
                    type:1,
                    info:[
                        [4,3]
                    ]
                }
            ]
        },
        transport:[ // 传送门
            {
                "type":0, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [2,8],
                    [12,3]
                ]
            },
            {
                "type":0, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [12,3],
                    [2,8]
                ]
            }
        ],
        fixed: [ // 固定物
            {
                type:5,
                position:[261,768-129]
            },
            {
                type:5,
                position:[989,768-639]
            }
        ],
        doorOffset:[1,20], // 门的偏移
        grid:[76,76], // 网格大小
        gridOffset:[-18,-39], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
			// 7 - 开关
			// 8 - 蝙蝠
			// 9 - 药瓶
            // 5 - 碗)
            [6,6,6,6,6,6,6,6,6,6,6,6,6,6],
			[6,0,0,7,0,0,0,0,6,0,0,0,2,6],
			[6,0,6,6,6,0,8,0,6,0,6,6,6,6],
			[6,0,6,4,0,0,0,0,0,0,0,0,0,6],
			[6,0,0,0,6,0,0,0,6,0,6,6,0,6],
			[6,9,6,3,6,0,6,0,0,0,9,6,0,6],
			[6,0,6,0,0,0,6,6,6,6,0,6,1,6],
			[6,0,0,5,6,5,6,0,6,6,0,6,0,6],
			[6,6,0,0,6,0,0,5,0,0,0,0,0,6],
			[6,6,6,6,6,6,6,6,6,6,6,6,6,6]
        ]
    },
    { // 关卡23
        torch:[
            [28,768-44],
            [179,768-37],
            [336,768-36],
            [491,768-38],
            [617,768-37],
            [884,768-29],
            [995,768-102],
            [870,768-148],
            [712,768-142],
            [164,768-139],
            [31,768-143],
            [29,768-255],
            [377,768-224],
            [437,768-284],
            [373,768-334],
            [447,768-404],
            [493,768-404],
            [639,768-410],
            [721,768-264],
            [716,768-147],
            [630,768-210],
            [873,768-286],
            [1001,768-205],
            [999,768-328],
            [1003,768-418],
            [892,768-401],
            [766,768-383],
            [635,768-409],
            [656,768-537],
            [791,768-529],
            [914,768-532],
            [415,768-541],
            [136,768-541],
            [26,768-510],
            [30,768-651]
        ],
        answer:[ // 问题列表
            {
                title:"黛玉作《秋窗风雨夕词》是仿古代何人所作？",
                keys:["A、张若虚","B、温庭筠","C、陈后主","D、隋炀帝"],
                result:1
            },
            {
                title:"芦雪庵即景联句诗，是谁说的第一句诗?",
                keys:["A、王熙凤","B、林黛玉","C、贾宝玉","D、史湘云"],
                result:1
            },
            {
                title:"“莫向东风怨别离”诗句是大观园中何人所作？",
                keys:["A、宝钗","B、黛玉","C、探春","D、湘云"],
                result:3
            },
            {
                title:"贾政把“花气袭人知昼（骤）暖”视为“浓词艳赋”，这句诗的作者是谁？",
                keys:["A、宝玉","B、苏轼","C、陆游","D、林黛玉"],
                result:3
            }
        ],
        roleDirection:1, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [7,6],
                    [9,6]
                ]
            },
            {
                "direction":1, // 0 - 横向； 1 - 纵向
                "fat":[
                    [9,4],
                    [9,6]
                ]
            },
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [10,6],
                    [12,6]
                ]
            }
        ],
        skeleton:[ // 骷髅
            {
                "direction":0, // 0 - 横向； 1 - 纵向
                "fat":[
                    [7,2],
                    [1,2]
                ]
            }
        ],
        fence: { // 栅栏
            default: [
                {
                    type:1,
                    info:[
                        [2,1]
                    ]
                },
                {
                    type:1,
                    info:[
                        [2,4]
                    ]
                },
                {
                    type:1,
                    info:[
                        [11,1]
                    ]
                },
                {
                    type:1,
                    info:[
                        [10,8]
                    ]
                },
                {
                    type:0,
                    info:[
                        [12,5]
                    ]
                }
            ],
            change:[
                {
                    type:1,
                    info:[
                        [3,8]
                    ]
                },
                {
                    type:1,
                    info:[
                        [8,6]
                    ]
                },
                {
                    type:1,
                    info:[
                        [9,1]
                    ]
                },
                {
                    type:1,
                    info:[
                        [12,8]
                    ]
                },
                {
                    type:0,
                    info:[
                        [1,5]
                    ]
                },
                {
                    type:0,
                    info:[
                        [9,7]
                    ]
                },
                {
                    type:0,
                    info:[
                        [12,2]
                    ]
                }
            ]
        },
        transport:[ // 传送门
            {
                "type":1, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [1,1],
                    [6,8]
                ]
            },
            {
                "type":1, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [6,8],
                    [1,1]
                ]
            },
            {
                "type":0, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [1,8],
                    [12,4]
                ]
            },
            {
                "type":0, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [12,4],
                    [1,8]
                ]
            }
        ],
        fixed: [ // 固定物
            {
                type:5,
                position:[198,768-352]
            },
            {
                type:5,
                position:[982,768-516]
            }
        ],
        doorOffset:[15,10], // 门的偏移
        grid:[78,78], // 网格大小
        gridOffset:[-40,-23], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
			// 7 - 开关
			// 8 - 蝙蝠
			// 9 - 药瓶
            // 5 - 碗
            // 10 - 开关)
            [6,6,6,6,6,6,6,0,6,6,6,6,4,6],
			[6,0,0,0,0,0,0,2,0,0,0,0,0,6],
			[6,7,6,0,0,0,0,0,0,6,0,6,0,6],
			[6,9,6,0,0,6,0,0,6,6,0,6,0,6],
			[6,5,0,0,9,6,6,0,6,0,0,6,10,6],
			[6,0,6,6,0,0,6,3,6,0,6,6,0,6],
			[6,5,0,0,0,0,0,0,0,0,0,0,0,6],
			[6,4,6,6,6,6,0,6,6,0,6,0,6,6],
			[6,0,1,0,4,6,0,0,0,0,0,5,0,4],
			[6,6,6,6,6,6,6,6,6,6,6,6,6,6]
        ]
    },
    { // 关卡24
        torch:[
            [52,768-61],
            [209,768-48],
            [344,768-36],
            [512,768-33],
            [820,768-32],
            [894,768-105],
            [974,768-186],
            [828,768-287],
            [696,768-174],
            [753,768-352],
            [477,768-232],
            [329,768-175],
            [184,768-251],
            [37,768-324],
            [187,768-390],
            [104,768-509],
            [191,768-580],
            [294,768-647],
            [394,768-492],
            [580,768-646],
            [751,768-571],
            [975,768-639],
            [872,768-502]
        ],
        answer:[ // 问题列表
            {
                title:"宝玉填《寄生草》曲是什么场合看戏之后仿作的？",
                keys:["A、元妃省亲","B、清虚观打醮","C、宝钗生日","D、元宵夜宴"],
                result:3
            },
            {
                title:"第一个对《红楼梦》作出美学评价的是谁？",
                keys:["A、王国维","B、鲁讯","C、胡适","D、俞平伯"],
                result:1
            },
            {
                title:"“纵有千年铁门槛，终须一个土馒头。”下列人物中最喜欢这两句诗的人是：",
                keys:["A、宝玉","B、惜春","C、妙玉","D、黛玉"],
                result:3
            },
            {
                title:"宝玉在太虚幻境看到了金陵十二钗正册、副册、又副册，其中鸳鸯属于哪一册？",
                keys:["A、正册","B、副册","C、又副册","D、未见其名"],
                result:4
            },
            {
                title:"大观园中有一处：“凤尾森森，龙吟细细”，“湘帘垂地，悄无人声”。住在这里的是谁",
                keys:["A、宝钗","B、黛玉","C、李纨","D、惜春"],
                result:2
            }
        ],
        roleDirection:1, // 0 - 上； 1 - 下； 2 - 左；3 - 右
        seamonster:[ // 海怪
            {
                "direction":1, // 0 - 横向； 1 - 纵向
                "fat":[
                    [12,5],
                    [12,7]
                ]
            }
        ],
        skeleton:[ // 骷髅
        ],
        fence: { // 栅栏
            default: [
                {
                    type:1,
                    info:[
                        [2,4]
                    ]
                }
            ],
            change:[
            ]
        },
        transport:[ // 传送门
            {
                "type":0, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [1,1],
                    [12,8]
                ]
            },
            {
                "type":0, // 0 - 蓝色； 1 - 绿色
                "fat":[
                    [12,8],
                    [1,1]
                ]
            }
        ],
        fixed: [ // 固定物
        ],
        doorOffset:[32,20], // 门的偏移
        grid:[75,72], // 网格大小
        gridOffset:[-29,-15], // 网格偏移
        grids:[10,14], // 网格模板
        gameGrids:[ // 网格定义(
            // 6 - 不可行走 非6可行走
            // 2 - 人物起始位置
            // 3 - 门
            // 1 - 梦
            // 4 - 树藤
			// 7 - 开关
			// 8 - 蝙蝠
			// 9 - 药瓶
            // 5 - 碗)
            [6,6,6,6,6,4,6,6,6,6,6,6,6,6],
			[6,0,6,0,0,0,0,6,0,0,0,6,6,6],
			[6,0,6,0,6,5,0,0,0,6,0,0,6,6],
			[6,0,6,0,0,0,6,4,0,0,0,1,0,6],
			[6,0,0,0,0,0,9,3,6,0,0,6,9,6],
			[6,6,6,0,0,5,0,4,4,0,6,6,0,6],
			[6,7,0,0,5,0,0,0,6,0,6,0,0,6],
			[6,6,0,0,0,6,0,0,0,0,6,6,0,6],
			[6,6,6,2,0,0,4,6,4,6,6,6,0,6],
			[6,6,6,6,6,6,6,6,6,6,6,6,6,6]
        ]
    }
];